espruino/Espruino/targets/nrf5x/bluetooth.c
void nrf_log_frontend_hexdump(uint32_t           severity_mid,
                              const void * const p_data,
                              uint16_t           length) {
  uint8_t *u8_data = (uint8_t *)p_data;
  unsigned int i;
  for (i=0;i<length;i++) {
    jshTransmitPrintf(DEFAULT_CONSOLE_DEVICE, "%02x ", u8_data[i]);
    if ((i&7) == 7) {
      jshTransmit(DEFAULT_CONSOLE_DEVICE, '\r');
      jshTransmit(DEFAULT_CONSOLE_DEVICE, '\n');
    }
  }
  jshTransmit(DEFAULT_CONSOLE_DEVICE, '\r');
  jshTransmit(DEFAULT_CONSOLE_DEVICE, '\n');
}

#ifdef NRF5X_SDK_15_3
const nrf_log_module_const_data_t m_nrf_log_app_logs_data_const = {
    .p_module_name = ""
};
#else
nrf_log_module_dynamic_data_t NRF_LOG_MODULE_DATA_DYNAMIC = {
    .module_id = 0
};
#endif
#endif

/// Function for handling an event from the Connection Parameters Module.
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt) {
}

/// Sigh - NFC has lots of these, so we need to define it to build
void log_uart_printf(const char * format_msg, ...) {
 // jsiConsolePrintf("NFC: %s\n", format_msg);
}

// -----------------------------------------------------------------------------------
// -------------------------------------------------------------------------- HANDLERS

#if NRF_SD_BLE_API_VERSION<5
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length) {
  jsble_peripheral_activity(); // flag that we've been busy
  jshPushIOCharEvents(EV_BLUETOOTH, (char*)p_data, length);
  jshHadEvent();
}
#else
static void nus_data_handler(ble_nus_evt_t * p_evt) {
  if (p_evt->type == BLE_NUS_EVT_RX_DATA) {
    jsble_peripheral_activity(); // flag that we've been busy
    jshPushIOCharEvents(EV_BLUETOOTH, (char*)p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
    jshHadEvent();
  }
}
#endif

void nus_transmit_string() {
  if (!jsble_has_peripheral_connection() ||
      !(bleStatus & BLE_NUS_INITED) ||
      (bleStatus & BLE_IS_SLEEPING)) {
    // If no connection, drain the output buffer
    nuxTxBufLength = 0;
    jshTransmitClearDevice(EV_BLUETOOTH);
    return;
  }
  /* 6 is the max number of packets we can send
   * in one connection interval on nRF52. We could
   * do 5, but it seems some things have issues with
   * this (eg nRF cloud gateways) so only send 1 packet
   * for now. */
  int max_data_len = MIN((m_peripheral_effective_mtu-3),BLE_NUS_MAX_DATA_LEN);
  for (int packet=0;packet<1;packet++) {
    // No data? try and get some from our queue
    if (!nuxTxBufLength) {
      nuxTxBufLength = 0;
      int ch = jshGetCharToTransmit(EV_BLUETOOTH);
      while (ch>=0) {
        nusTxBuf[nuxTxBufLength++] = ch;
        if (nuxTxBufLength>=max_data_len) break;
        ch = jshGetCharToTransmit(EV_BLUETOOTH);
      }
    }
    // If there's no data in the queue, nothing to do - leave
    if (!nuxTxBufLength) return;
    jsble_peripheral_activity(); // flag that we've been busy
    // We have data - try and send it

#if NRF_SD_BLE_API_VERSION>5
    uint32_t err_code = ble_nus_data_send(&m_nus, nusTxBuf, &nuxTxBufLength, m_peripheral_conn_handle);
#elif NRF_SD_BLE_API_VERSION<5
    uint32_t err_code = ble_nus_string_send(&m_nus, nusTxBuf, nuxTxBufLength);
#else // NRF_SD_BLE_API_VERSION==5
    uint32_t err_code = ble_nus_string_send(&m_nus, nusTxBuf, &nuxTxBufLength);
#endif
    if (err_code == NRF_SUCCESS) {
      nuxTxBufLength=0; // everything sent Ok
      bleStatus |= BLE_IS_SENDING;
    } else if (err_code==NRF_ERROR_INVALID_STATE) {
      // If no notifications we are connected but the central isn't reading, so sends will fail.
      // Ideally we check m_nus.is_notification_enabled but SDK15 changed this, so lets just see if
      // the send creates a NRF_ERROR_INVALID_STATE error
      nuxTxBufLength = 0; // clear tx buffer
      jshTransmitClearDevice(EV_BLUETOOTH); // clear all tx data in queue
    }
    /* if it failed to send all or any data we keep it around in
     * nusTxBuf (with count in nuxTxBufLength) so next time around
     * we can try again. */
  }
}

/// Radio Notification handler
void SWI1_IRQHandler(bool radio_evt) {
  if (bleStatus & BLE_NUS_INITED)
    nus_transmit_string();
  // If we're doing multiple advertising, iterate through advertising options
  if ((bleStatus & BLE_IS_ADVERTISING)  && (bleStatus & BLE_IS_ADVERTISING_MULTIPLE)) {
    int idx = (bleStatus&BLE_ADVERTISING_MULTIPLE_MASK)>>BLE_ADVERTISING_MULTIPLE_SHIFT;
    JsVar *advData = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_ADVERTISE_DATA);
    bool ok = true;
    if (jsvIsArray(advData)) {
      JsVar *data = jsvGetArrayItem(advData, idx);
      idx = (idx+1) % jsvGetArrayLength(advData);
      bleStatus = (bleStatus&~BLE_ADVERTISING_MULTIPLE_MASK) | (idx<<BLE_ADVERTISING_MULTIPLE_SHIFT);
      JSV_GET_AS_CHAR_ARRAY(dPtr, dLen, data);
      if (dPtr && dLen) {
        uint32_t err_code = jsble_advertising_update_advdata(dPtr, dLen);
        if (err_code)
          ok = false; // error setting BLE - disable
      } else {
        // Invalid adv data - disable
        ok = false;
      }
      jsvUnLock(data);
    } else {
      // no advdata - disable multiple advertising
      ok = false;
    }
    if (!ok) {
      bleStatus &= ~(BLE_IS_ADVERTISING_MULTIPLE|BLE_ADVERTISING_MULTIPLE_MASK);
    }
    jsvUnLock(advData);
  }
#ifdef DYNAMIC_INTERVAL_ADJUSTMENT
 // Handle Dynamic Interval Adjustment
 if (bleIdleCounter<BLE_DYNAMIC_INTERVAL_IDLE_TIME) {
   bleIdleCounter++;
 } else {
   if (jsble_has_peripheral_connection() &&
       !(bleStatus & BLE_DISABLE_DYNAMIC_INTERVAL) &&
       bleHighInterval) {
     bleHighInterval = false;
     jsble_set_periph_connection_interval(BLE_DYNAMIC_INTERVAL_LOW_RATE, BLE_DYNAMIC_INTERVAL_LOW_RATE);
   }
 }
#endif

#ifndef NRF52_SERIES
  /* NRF52 has a systick. On nRF51 we just hook on
  to this, since it happens quite often */
  void SysTick_Handler(void);
  SysTick_Handler();
#endif
}

#if PEER_MANAGER_ENABLED
static void ble_update_whitelist() {
  uint32_t err_code;
  if (m_is_wl_changed) {
    // The whitelist has been modified, update it in the Peer Manager.
    err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
    APP_ERROR_CHECK_NOT_URGENT(err_code);

    err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
    if (err_code != NRF_ERROR_NOT_SUPPORTED)
      APP_ERROR_CHECK_NOT_URGENT(err_code);

