espruino/Espruino/targets/nrf5x/bluetooth.c
    m_is_wl_changed = false;
  }
}
#endif

/// Function for the application's SoftDevice event handler.
#if NRF_SD_BLE_API_VERSION<5
static void ble_evt_handler(ble_evt_t * p_ble_evt) {
#else
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context) {
#endif

  /*if (p_ble_evt->header.evt_id != 87 && // ignore write complete (SDK14+?)
      p_ble_evt->header.evt_id != BLE_GATTS_EVT_WRITE && // Write operation performed (eg after we transmit on UART)
      p_ble_evt->header.evt_id != BLE_EVT_TX_COMPLETE)
    jsiConsolePrintf("[%d %d]\n", p_ble_evt->header.evt_id, p_ble_evt->evt.gattc_evt.params.hvx.handle );*/
#if ESPR_BLUETOOTH_ANCS
  if (bleStatus & BLE_ANCS_AMS_OR_CTS_INITED)
    ble_ancs_on_ble_evt(p_ble_evt);
#endif
    uint32_t err_code;


    switch (p_ble_evt->header.evt_id) {
      case BLE_GAP_EVT_TIMEOUT:
#if CENTRAL_LINK_COUNT>0
        if (bleInTask(BLETASK_BONDING)) { // BLE_GAP_TIMEOUT_SRC_SECURITY_REQUEST ?
          jsble_queue_pending(BLEP_TASK_FAIL_CONN_TIMEOUT, 0);
        } else if (bleInTask(BLETASK_CONNECT)) {
          jsble_queue_pending(BLEP_TASK_FAIL_CONN_TIMEOUT, 0);
        } else
#endif
        {
          // the timeout for sd_ble_gap_adv_start expired - kick it off again
          bleStatus &= ~BLE_IS_ADVERTISING; // we still think we're advertising, but we stopped
          jsble_queue_pending(BLEP_ADVERTISING_START, 0); // start advertising again
        }
        break;

#if CENTRAL_LINK_COUNT>0
      case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
      {
          const ble_gap_evt_t * const p_gap_evt = &p_ble_evt->evt.gap_evt;
          // Accept parameters requested by peer.
          err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                      &p_gap_evt->params.conn_param_update_request.conn_params);
          //if (err_code!=NRF_ERROR_INVALID_STATE) APP_ERROR_CHECK_NOT_URGENT(err_code);
          // This sometimes fails with NRF_ERROR_INVALID_STATE if this request
          // comes in between sd_ble_gap_disconnect being called and the DISCONNECT
          // event being received. The SD obviously does the checks for us, so lets
          // avoid crashing because of it!
      } break; // BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST
#endif

      case BLE_GAP_EVT_CONNECTED:
        // set connection transmit power
#if NRF_SD_BLE_API_VERSION > 5
        sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, p_ble_evt->evt.gap_evt.conn_handle, m_tx_power);
#endif
        if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) {
          m_peripheral_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
#ifdef EXTENSIBLE_MTU
          m_peripheral_effective_mtu = GATT_MTU_SIZE_DEFAULT;
#endif
#ifdef DYNAMIC_INTERVAL_ADJUSTMENT
          bleIdleCounter = 0;
#endif
          if (bleStatus & BLE_IS_RSSI_SCANNING) // attempt to restart RSSI scan
            sd_ble_gap_rssi_start(m_peripheral_conn_handle, 0, 0);
          bleStatus &= ~BLE_IS_SENDING; // reset state - just in case
#if BLE_HIDS_ENABLED
          bleStatus &= ~BLE_IS_SENDING_HID;
#endif
          jsble_queue_pending(BLEP_ADVERTISING_STOP, 0); //  we're not advertising now we're connected
#ifndef SAVE_ON_FLASH
          if (!(bleStatus & BLE_IS_SLEEPING) && (bleStatus & BLE_ADVERTISE_WHEN_CONNECTED))
            jsble_queue_pending(BLEP_ADVERTISING_START, 0); // start advertising again if ADVERTISE_WHEN_CONNECTED
#endif

          if (!jsiIsConsoleDeviceForced() && (bleStatus & BLE_NUS_INITED)) {
            jsiClearInputLine(false); // clear the input line on connect
            jsiSetConsoleDevice(EV_BLUETOOTH, false);
          }
          jsble_queue_pending_buf(BLEP_CONNECTED, 0, (char*)&p_ble_evt->evt.gap_evt.params.connected.peer_addr, sizeof(ble_gap_addr_t));
#ifndef SAVE_ON_FLASH
          m_peripheral_addr = p_ble_evt->evt.gap_evt.params.connected.peer_addr;
#endif
        }
#if CENTRAL_LINK_COUNT>0
        if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_CENTRAL) {
          int centralIdx;
          for (centralIdx=0;centralIdx<CENTRAL_LINK_COUNT;centralIdx++) {
            if (m_central_conn_handles[centralIdx]==BLE_CONN_HANDLE_INVALID) {
              m_central_conn_handles[centralIdx] = p_ble_evt->evt.gap_evt.conn_handle;
              break;
            }
          }
          if (centralIdx==CENTRAL_LINK_COUNT) {
            jsWarn("BLE_GAP_EVT_CONNECTED, but no m_central_conn_handles\n");
            break; // no connection allocated??
          }
#ifdef EXTENSIBLE_MTU
          m_central_effective_mtu = GATT_MTU_SIZE_DEFAULT;
#endif
#if NRF_SD_BLE_API_VERSION>=3
#if (NRF_BLE_MAX_MTU_SIZE > GATT_MTU_SIZE_DEFAULT)
          err_code = sd_ble_gattc_exchange_mtu_request(p_ble_evt->evt.gap_evt.conn_handle, NRF_BLE_MAX_MTU_SIZE);
          APP_ERROR_CHECK_NOT_URGENT(err_code);
#endif
#endif
          jsble_queue_pending(BLEP_TASK_CENTRAL_CONNECTED, centralIdx); // index in m_central_conn_handles
        }
#endif
        break;

      case BLE_GAP_EVT_DISCONNECTED: {

#ifdef DYNAMIC_INTERVAL_ADJUSTMENT
        // set to high interval ready for next connection
        if (!bleHighInterval) {
          bleHighInterval = true;
          /* On NRF_SD_BLE_API_VERSION<5 the interval is remembered between connections, so when we
           * disconnect we need to set it back to default. On later versions it always goes back to
           * what was used with ble_conn_params_init so we don't have to worry. */
#if NRF_SD_BLE_API_VERSION<5
          jsble_set_periph_connection_interval(BLE_DYNAMIC_INTERVAL_HIGH_RATE, BLE_DYNAMIC_INTERVAL_HIGH_RATE);
#endif
        }
#endif

#if PEER_MANAGER_ENABLED
        ble_update_whitelist();
#endif

#if CENTRAL_LINK_COUNT>0
        int centralIdx = jsble_get_central_connection_idx(p_ble_evt->evt.gap_evt.conn_handle);
        if (centralIdx>=0) {
          jsble_queue_pending(BLEP_CENTRAL_DISCONNECTED, p_ble_evt->evt.gap_evt.params.disconnected.reason | (centralIdx<<8));
          m_central_conn_handles[centralIdx] = BLE_CONN_HANDLE_INVALID;

