espruino/Espruino/targets/nrf5x/bluetooth.c
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
          jsble_queue_pending(BLEP_BONDING_STATUS, BLE_BOND_FAIL);
          /** In some cases, when securing fails, it can be restarted directly. Sometimes it can
           *  be restarted, but only after changing some Security Parameters. Sometimes, it cannot
           *  be restarted until the link is disconnected and reconnected. Sometimes it is
           *  impossible, to secure the link, or the peer device does not support it. How to
           *  handle this error is highly application dependent. */
          switch (p_evt->params.conn_sec_failed.error)
          {
              case PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING:
                  // Rebond if one party has lost its keys.
                  err_code = pm_conn_secure(p_evt->conn_handle, true);
                  if (err_code != NRF_ERROR_INVALID_STATE)
                  {
                    APP_ERROR_CHECK_NOT_URGENT(err_code);
                  }
                  break; // PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING

              default:
                  break;
          }
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            // Still allow a device to pair if it doesn't have bonding info for us
            /* TODO: we could turn this off with a flag? Stops someone reconnecting
             * by spoofing a peer. */
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true };
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

#if (NRF_SD_BLE_API_VERSION >= 5)
        case PM_EVT_CONN_SEC_PARAMS_REQ: {
            ble_gap_sec_params_t own_params = m_sec_params;
            const ble_gap_sec_params_t *peer_params = p_evt->params.conn_sec_params_req.p_peer_params;
            if (!jsble_can_pair_with_peer(&own_params, peer_params)) {
                // reject security procedure
                err_code = pm_conn_sec_params_reply(p_evt->conn_handle, NULL,
                                                    p_evt->params.conn_sec_params_req.p_context);
                APP_ERROR_CHECK_NOT_URGENT(err_code);
            }
        } break;
#endif

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
              APP_ERROR_CHECK_NOT_URGENT(err_code);
            }
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
            // Assert.
            jsWarn("PM: PM_EVT_ERROR_UNEXPECTED %d", p_evt->params.error_unexpected.error);
            //APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
            break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
            break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
          // Used to assert here
            jsWarn("PM: DATA_UPDATE_FAILED");
            break;

        case PM_EVT_PEER_DELETE_SUCCEEDED:
            break;

        case PM_EVT_PEER_DELETE_FAILED:
            // Assert.
            jsWarn("PM: PM_EVT_PEER_DELETE_FAILED %d", p_evt->params.peer_delete_failed.error);
            break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            if (!(bleStatus & BLE_IS_SLEEPING))
              jsble_queue_pending(BLEP_ADVERTISING_START, 0); // start advertising again if not asleep
            break;

        case PM_EVT_PEERS_DELETE_FAILED:
            // Assert.
            jsWarn("PM: PM_EVT_PEERS_DELETE_FAILED %d", p_evt->params.peers_delete_failed_evt.error);
            //APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
            break;

        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
            break;

        default:
            // No implementation needed.
            break;
    }
}
#endif


#if BLE_HIDS_ENABLED
/// Function for handling the HID Report Characteristic Write event.
static void on_hid_rep_char_write(ble_hids_evt_t * p_evt) {
    if (p_evt->params.char_write.char_id.rep_type == BLE_HIDS_REP_TYPE_OUTPUT){
        uint32_t err_code;
        uint8_t  report_val;
        uint8_t  report_index = p_evt->params.char_write.char_id.rep_index;

        if (report_index == HID_OUTPUT_REPORT_INDEX) {
            // This code assumes that the output report is one byte long. Hence the following
            // static assert is made.
            STATIC_ASSERT(HID_OUTPUT_REPORT_MAX_LEN == 1);

            err_code = ble_hids_outp_rep_get(&m_hids,
                                             report_index,
                                             HID_OUTPUT_REPORT_MAX_LEN,
                                             0,
#if NRF_SD_BLE_API_VERSION>5
                                             m_peripheral_conn_handle,
#endif
                                             &report_val);
            APP_ERROR_CHECK_NOT_URGENT(err_code);
            // (report_val & 2) is caps lock
            jsble_queue_pending(BLEP_HID_VALUE, report_val);
        }
    }
}

/// Function for handling HID events.
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt) {
    switch (p_evt->evt_type)
    {
        case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
            m_in_boot_mode = true;
            break;

        case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
            m_in_boot_mode = false;
            break;

        case BLE_HIDS_EVT_REP_CHAR_WRITE:
            on_hid_rep_char_write(p_evt);
            break;

        case BLE_HIDS_EVT_NOTIF_ENABLED:
            break;

        default:
            // No implementation needed.
            break;
    }
}
#endif

// -----------------------------------------------------------------------------------
// -------------------------------------------------------------------- INITIALISATION

