espruino/Espruino/targets/nrf5x/bluetooth.c
void jsble_update_security() {
#if PEER_MANAGER_ENABLED
  bool encryptUart = false;
  bool mitmProtect = false;
  ble_gap_sec_params_t sec_param = get_gap_sec_params();
  m_sec_params = sec_param;
  // encrypt UART and require mitm protection for out of band pairing
  if (sec_param.oob) {
    encryptUart = true;
    mitmProtect = true;
  }
  // if mitm protection is requested, we also need to encrypt the UART
  if (sec_param.mitm) {
    encryptUart = true;
    mitmProtect = true;
  }


  uint32_t err_code = pm_sec_params_set(&sec_param);
  jsble_check_error(err_code);

  JsVar *options = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_SECURITY);
  if (jsvIsObject(options)) {
    JsVar *v;
    if (jsvGetBoolAndUnLock(jsvObjectGetChildIfExists(options, "encryptUart")))
      encryptUart = true;
    // Check for passkey
    uint8_t passkey[BLE_GAP_PASSKEY_LEN+1];
    memset(passkey, 0, sizeof(passkey));
    v = jsvObjectGetChildIfExists(options, "passkey");
    if (jsvIsString(v)) jsvGetString(v, (char*)passkey, sizeof(passkey));
    jsvUnLock(v);
    //jsiConsolePrintf("PASSKEY %d %d %d %d %d %d\n",passkey[0],passkey[1],passkey[2],passkey[3],passkey[4],passkey[5]);
    ble_opt_t pin_option;
    pin_option.gap_opt.passkey.p_passkey = NULL;
    if (passkey[0]) {
      pin_option.gap_opt.passkey.p_passkey = passkey;
      encryptUart = true;
      mitmProtect = true;
    }
    uint32_t err_code =  sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &pin_option);
    jsble_check_error(err_code);
  }
  // If UART encryption or mitm protection status changed, we need to update flags and restart Bluetooth
  if (((bleStatus & BLE_ENCRYPT_UART) != 0) != encryptUart || ((bleStatus & BLE_SECURITY_MITM) != 0) != mitmProtect) {
    if (encryptUart) bleStatus |= BLE_ENCRYPT_UART;
    else bleStatus &= ~BLE_ENCRYPT_UART;
    if (mitmProtect) bleStatus |= BLE_SECURITY_MITM;
    else bleStatus &= ~BLE_SECURITY_MITM;
    // But only restart if the UART was enabled
    if (bleStatus & BLE_NUS_INITED)
      bleStatus |= BLE_NEEDS_SOFTDEVICE_RESTART;
  }
#endif
}

#if PEER_MANAGER_ENABLED

/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;

    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                     *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;

    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
    {
        p_peers[(*p_size)++] = peer_id;
        peer_id = pm_next_peer_id_get(peer_id);
    }
}

static uint32_t flash_end_addr(void)
{
#if NRF_SD_BLE_API_VERSION>=5
// Copied from fds.c because this isn't exported :(
    uint32_t const bootloader_addr = NRF_UICR->NRFFW[0];
    uint32_t const page_sz         = NRF_FICR->CODEPAGESIZE;
    uint32_t const code_sz         = NRF_FICR->CODESIZE;
    return (bootloader_addr != 0xFFFFFFFF) ? bootloader_addr : (code_sz * page_sz);
#else
    return (uint32_t)FS_PAGE_END_ADDR;
#endif
}
static void peer_manager_erase_pages(){
    int i;
    for (i=1;i<=FDS_PHY_PAGES;i++)
      jshFlashErasePage((flash_end_addr()) - i*FDS_PHY_PAGE_SIZE);
}
static void peer_manager_init(bool erase_bonds) {

  /* Only initialise the peer manager once. This stops
   * crashes caused by repeated SD restarts (jsble_restart_softdevice) */
  if (bleStatus & BLE_PM_INITIALISED) return;
  bleStatus |= BLE_PM_INITIALISED;

  /* If ALL buttons are pressed at boot, clear out flash
   pages as well. Nice easy way to reset!

   We know this only happens at boot because of the
   BLE_PM_INITIALISED check above.
  */
  bool buttonPressed = false;
#ifdef BTN1_PININDEX
  buttonPressed = jshPinGetValue(BTN1_PININDEX) == BTN1_ONSTATE;
#endif
#ifdef BTN2_PININDEX
  buttonPressed &= jshPinGetValue(BTN2_PININDEX) == BTN2_ONSTATE;
#endif
#ifdef BTN3_PININDEX
  buttonPressed &= jshPinGetValue(BTN3_PININDEX) == BTN3_ONSTATE;
#endif
#ifdef BTN4_PININDEX
  buttonPressed &= jshPinGetValue(BTN4_PININDEX) == BTN4_ONSTATE;
#endif
  if (buttonPressed) {
    peer_manager_erase_pages();
  }

  ret_code_t           err_code;

  err_code = pm_init();
  /* If pm init failed, erase pm/fds storage to prevent reboot loop
   * This can happen if fds storage is full */
  if (err_code != NRF_SUCCESS){
    peer_manager_erase_pages();
    err_code = pm_init();
  }
  APP_ERROR_CHECK(err_code);

  if (erase_bonds)
  {
      err_code = pm_peers_delete();
      APP_ERROR_CHECK_NOT_URGENT(err_code);
  }

  jsble_update_security(); // pm_sec_params_set

  err_code = pm_register(pm_evt_handler);
  APP_ERROR_CHECK(err_code);

  err_code = fds_register(fds_evt_handler);
  APP_ERROR_CHECK(err_code);

  memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
  m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

  peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

  err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
  APP_ERROR_CHECK_NOT_URGENT(err_code);

  // Setup the device identies list.
  // Some SoftDevices do not support this feature.
  err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
  if (err_code != NRF_ERROR_NOT_SUPPORTED) {
    APP_ERROR_CHECK_NOT_URGENT(err_code);
  }

#ifdef LINK_SECURITY
  ecc_init(true);

  err_code = ecc_p256_keypair_gen(m_lesc_sk.sk, m_lesc_pk.pk);
  APP_ERROR_CHECK_NOT_URGENT(err_code);

  /* Set the public key */
  err_code = pm_lesc_public_key_set(&m_lesc_pk);
  APP_ERROR_CHECK_NOT_URGENT(err_code);
#endif
}
#endif

#if BLE_HIDS_ENABLED
static void hids_init(uint8_t *reportPtr, size_t reportLen) {
    uint32_t                   err_code;
    ble_hids_init_t            hids_init_obj;
    static ble_hids_inp_rep_init_t    input_report_array[1];
    ble_hids_inp_rep_init_t  * p_input_report;
    static ble_hids_outp_rep_init_t   output_report_array[1];
    ble_hids_outp_rep_init_t * p_output_report;
    uint8_t                    hid_info_flags;

    memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));
    memset((void *)output_report_array, 0, sizeof(ble_hids_outp_rep_init_t));

    // Initialize HID Service
    p_input_report                      = &input_report_array[HID_INPUT_REPORT_KEYS_INDEX];
    p_input_report->max_len             = HID_KEYS_MAX_LEN;
    p_input_report->rep_ref.report_id   = HID_INPUT_REP_REF_ID;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

#if NRF_SD_BLE_API_VERSION>=7 || NRF5X_SDK_15_3
    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr      = SEC_JUST_WORKS;
    p_input_report->sec.rd      = SEC_JUST_WORKS;
#else
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_input_report->security_mode.write_perm);
#endif

    p_output_report                      = &output_report_array[HID_OUTPUT_REPORT_INDEX];
    p_output_report->max_len             = HID_OUTPUT_REPORT_MAX_LEN;
    p_output_report->rep_ref.report_id   = HID_OUTPUT_REP_REF_ID;
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

#if NRF_SD_BLE_API_VERSION>=7 || NRF5X_SDK_15_3
    p_output_report->sec.wr      = SEC_JUST_WORKS;
    p_output_report->sec.rd      = SEC_JUST_WORKS;
#else
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_output_report->security_mode.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&p_output_report->security_mode.write_perm);
#endif

    hid_info_flags = HID_INFO_FLAG_REMOTE_WAKE_MSK | HID_INFO_FLAG_NORMALLY_CONNECTABLE_MSK;

