espruino/Espruino/targets/nrf5x/bluetooth.c
    nrf_clock_lf_cfg_t clock_lf_cfg = {
#ifdef ESPR_LSE_ENABLE
    // enable if we're on a device with 32kHz xtal
        .source        = NRF_CLOCK_LF_SRC_XTAL,
        .rc_ctiv       = 0,
        .rc_temp_ctiv  = 0,
        .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_20_PPM,
#else
        .source        = NRF_CLOCK_LF_SRC_RC,
        .rc_ctiv       = 16, // recommended for nRF52
        .rc_temp_ctiv  = 2,  // recommended for nRF52
        .xtal_accuracy = 0
#endif
    };

    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, false);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

#ifdef NRF52_SERIES
    ble_enable_params.common_enable_params.vs_uuid_count = 10;
#else
    ble_enable_params.common_enable_params.vs_uuid_count = 3;
#endif

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION >= 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif

    err_code = sd_ble_enable(&ble_enable_params,&app_ram_base);
    APP_ERROR_CHECK(err_code);
    // if the RAM base is correct, set it to 0 so we don't include it in process.env
    if (app_ram_base == orig_app_ram_base) app_ram_base=0;

#if (NRF_BLE_MAX_MTU_SIZE > GATT_MTU_SIZE_DEFAULT)
    {
        ble_opt_t gap_opt;
        gap_opt.gap_opt.ext_len.rxtx_max_pdu_payload_size = NRF_BLE_MAX_MTU_SIZE+4;
        err_code = sd_ble_opt_set(BLE_GAP_OPT_EXT_LEN, &gap_opt);
        APP_ERROR_CHECK(err_code);
        gap_opt.common_opt.conn_evt_ext.enable = 1;
        err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &gap_opt); // enable DLE
        APP_ERROR_CHECK(err_code);
    }
#endif
    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(soc_evt_handler);
    APP_ERROR_CHECK(err_code);


#else // NRF_SD_BLE_API_VERSION>=5
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);
#if (NRF_BLE_MAX_MTU_SIZE > GATT_MTU_SIZE_DEFAULT)
    {
        ble_cfg_t cfg;
        memset(&cfg, 0, sizeof(ble_cfg_t));
        cfg.conn_cfg.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;
        cfg.conn_cfg.params.gatt_conn_cfg.att_mtu = NRF_BLE_MAX_MTU_SIZE;
        err_code = sd_ble_cfg_set(BLE_CONN_CFG_GATT, &cfg, app_ram_base);
        APP_ERROR_CHECK(err_code);
    }
#endif

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&app_ram_base);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, soc_evt_handler, NULL);
#endif

#if defined(PUCKJS) || defined(RUUVITAG) || defined(ESPR_DCDC_ENABLE)
    // can only be enabled if we're sure we have a DC-DC
    err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    APP_ERROR_CHECK(err_code);
#endif
#ifdef DEBUG
    // disable watchdog timer in debug mode, so we can use GDB
    NRF_WDT->CONFIG &= ~8;
#endif
}

// -----------------------------------------------------------------------------------
// -------------------------------------------------------------------- OTHER


/// Build advertising data struct to pass into @ref ble_advertising_init.
void jsble_setup_advdata(ble_advdata_t *advdata) {
  memset(advdata, 0, sizeof(*advdata));
  advdata->name_type          = BLE_ADVDATA_FULL_NAME;
  advdata->include_appearance = false;
  advdata->flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
}

#if NRF_SD_BLE_API_VERSION>5
static ble_gap_adv_data_t m_ble_gap_adv_data;
// SoftDevice >= 6.1.0 needs this as static buffers
static uint8_t m_adv_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
static uint8_t m_scan_rsp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX]; // 31
#endif

uint32_t jsble_advertising_update(uint8_t *advPtr, unsigned int advLen, uint8_t *rspPtr, unsigned int rspLen, ble_gap_adv_params_t *adv_params) {
#if NRF_SD_BLE_API_VERSION>5
  if (bleStatus & BLE_IS_ADVERTISING){
    // first we need to switch away from our static live advertising data buffers
    // otherwise we would get NRF_ERROR_INVALID_STATE from sd_ble_gap_adv_set_configure
    ble_gap_adv_data_t tmp;
    uint8_t tmp_adv_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];
    uint8_t tmp_scan_rsp_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];

    tmp.adv_data.len = m_ble_gap_adv_data.adv_data.len;
    if (tmp.adv_data.len){
      memcpy(tmp_adv_data, m_adv_data, tmp.adv_data.len);
      tmp.adv_data.p_data = tmp_adv_data;
    } else tmp.adv_data.p_data = NULL;

    tmp.scan_rsp_data.len = m_ble_gap_adv_data.scan_rsp_data.len;
    if (tmp.scan_rsp_data.len){
      memcpy(tmp_scan_rsp_data, m_scan_rsp_data, tmp.scan_rsp_data.len);
      tmp.scan_rsp_data.p_data = tmp_scan_rsp_data;
    } else tmp.scan_rsp_data.p_data = NULL;

    sd_ble_gap_adv_set_configure(&m_adv_handle, &tmp, NULL);
  }

  // now we can modify data and switch back to it
  if (advPtr){
    if (advLen){
      advLen=MIN(advLen,BLE_GAP_ADV_SET_DATA_SIZE_MAX);
      memcpy(m_adv_data, advPtr, advLen);
    }
    m_ble_gap_adv_data.adv_data.p_data = m_adv_data;
    m_ble_gap_adv_data.adv_data.len = advLen;
  }
  if (rspPtr){
    if (rspLen){
      rspLen=MIN(rspLen,BLE_GAP_ADV_SET_DATA_SIZE_MAX);
      memcpy(m_scan_rsp_data, rspPtr, rspLen);
    }
    m_ble_gap_adv_data.scan_rsp_data.p_data = m_scan_rsp_data;
    m_ble_gap_adv_data.scan_rsp_data.len = rspLen;
  }
  return sd_ble_gap_adv_set_configure(&m_adv_handle, &m_ble_gap_adv_data, adv_params);
#else
  return sd_ble_gap_adv_data_set((uint8_t *)advPtr, advLen, (uint8_t *)rspPtr, rspLen);
#endif
}

uint32_t jsble_advertising_start() {
  jsDebug(DBG_INFO,"jsble_advertising_start\n");
  // try not to call from IRQ as we might want to allocate JsVars
  if (bleStatus & BLE_IS_ADVERTISING) return 0;

#ifndef SAVE_ON_FLASH
  /* If we're not allowed to advertise because we are connected, just return */
  if (!(bleStatus & BLE_ADVERTISE_WHEN_CONNECTED) && jsble_has_peripheral_connection())
    return 0;
#endif

  ble_advdata_t scanrsp;

