espruino/Espruino/targets/nrf5x/bluetooth.c
  JsVar *advDataVar = jswrap_ble_getCurrentAdvertisingData();
  JSV_GET_AS_CHAR_ARRAY(advPtr, advLen, advDataVar);

  // Set up scan response packet's contents
  ble_uuid_t adv_uuids[ADVERTISE_MAX_UUIDS];
  int adv_uuid_count = 0;
  if (bleStatus & BLE_HID_INITED) {
    adv_uuids[adv_uuid_count].uuid = BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE;
    adv_uuids[adv_uuid_count].type = BLE_UUID_TYPE_BLE;
    adv_uuid_count++;
  }
  if (bleStatus & BLE_NUS_INITED) {
    adv_uuids[adv_uuid_count].uuid = BLE_UUID_NUS_SERVICE;
    adv_uuids[adv_uuid_count].type = BLE_UUID_TYPE_VENDOR_BEGIN; ///< We just assume we're the first 128 bit UUID in the list!
    adv_uuid_count++;
  }
  // add any user-defined services
  JsVar *advServices = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_SERVICE_ADVERTISE);
  if (jsvIsArray(advServices)) {
    JsvObjectIterator it;
    jsvObjectIteratorNew(&it, advServices);
    while (jsvObjectIteratorHasValue(&it)) {
      ble_uuid_t ble_uuid;
      if (adv_uuid_count < ADVERTISE_MAX_UUIDS &&
          !bleVarToUUIDAndUnLock(&ble_uuid, jsvObjectIteratorGetValue(&it))) {
        adv_uuids[adv_uuid_count++] = ble_uuid;
      }
      jsvObjectIteratorNext(&it);
    }
    jsvObjectIteratorFree(&it);
  }
  jsvUnLock(advServices);
  // check for any options set up
  JsVar *advOptions = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_ADVERTISE_OPTIONS);
  // update scan response packet
  memset(&scanrsp, 0, sizeof(scanrsp));
  scanrsp.uuids_complete.uuid_cnt = adv_uuid_count;
  scanrsp.uuids_complete.p_uuids  = &adv_uuids[0];


  ble_gap_adv_params_t adv_params;
  memset(&adv_params, 0, sizeof(adv_params));
  bool non_connectable = (bleStatus & BLE_IS_NOT_CONNECTABLE) || jsble_has_peripheral_connection(); // can't advertise connectable if we already have a connection
  bool non_scannable = bleStatus & BLE_IS_NOT_SCANNABLE;
#if NRF_SD_BLE_API_VERSION>5
  adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
  adv_params.secondary_phy   = BLE_GAP_PHY_AUTO; // the default
  adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
  adv_params.duration  = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;
  //adv_params.scan_req_notification = 1; // creates a BLE_GAP_EVT_SCAN_REQ_REPORT event
  if (jsvIsObject(advOptions)) { // extended SDK15+ options
    JsVar *advPhy = jsvObjectGetChildIfExists(advOptions, "phy");
    if (jsvIsUndefined(advPhy) || jsvIsStringEqual(advPhy,"1mbps")) {
      // default
    } else if (jsvIsStringEqual(advPhy,"2mbps")) {
      adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
      adv_params.secondary_phy   = BLE_GAP_PHY_2MBPS;
    } else if (jsvIsStringEqual(advPhy,"coded")) {
      adv_params.primary_phy     = BLE_GAP_PHY_CODED; // must use 1mbps phy if connectable?
      adv_params.secondary_phy   = BLE_GAP_PHY_CODED;
    } else jsWarn("Unknown phy %q\n", advPhy);
    jsvUnLock(advPhy);
  }
  if (adv_params.secondary_phy == BLE_GAP_PHY_AUTO) {
    // the default...
    adv_params.properties.type = non_connectable
          ? (non_scannable ? BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED : BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED)
          : (non_scannable ? BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED/*experimental*/ : BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED);
  } else { // coded/2mbps - force use of extended advertising
    adv_params.properties.type = non_connectable
        ? (non_scannable ? BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED : BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_SCANNABLE_UNDIRECTED)
        : (non_scannable ? BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED : BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED);
  }
#else
  adv_params.type        = non_connectable
      ? (non_scannable ? BLE_GAP_ADV_TYPE_ADV_NONCONN_IND : BLE_GAP_ADV_TYPE_ADV_SCAN_IND)
      : (non_scannable ? BLE_GAP_ADV_TYPE_ADV_DIRECT_IND : BLE_GAP_ADV_TYPE_ADV_IND);
  adv_params.fp          = BLE_GAP_ADV_FP_ANY;
  adv_params.timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
#endif
  jsvUnLock(advOptions);
  adv_params.p_peer_addr = NULL;
  adv_params.interval = bleAdvertisingInterval;

  uint32_t err_code = 0;
  uint8_t m_enc_scan_response_data[31]; // BLE_GAP_ADV_SET_DATA_SIZE_MAX
  uint16_t m_enc_scan_response_data_len = sizeof(m_enc_scan_response_data);
#if NRF_SD_BLE_API_VERSION<5
  err_code = adv_data_encode(&scanrsp, m_enc_scan_response_data, &m_enc_scan_response_data_len);
#else
  err_code = ble_advdata_encode(&scanrsp, m_enc_scan_response_data, &m_enc_scan_response_data_len);
#endif
  if (jsble_check_error(err_code)) {
    jsvUnLock(advDataVar);
    return err_code;
  }

  //jsiConsolePrintf("adv_data_set %d %d\n", advPtr, advLen);
#if NRF_SD_BLE_API_VERSION>5
  memset(&m_ble_gap_adv_data, 0, sizeof(m_ble_gap_adv_data));
#endif
  err_code = jsble_advertising_update(
    (uint8_t*)advPtr, advLen,
    non_scannable ? NULL : m_enc_scan_response_data, non_scannable ? 0 : m_enc_scan_response_data_len,
    &adv_params
  );
  jsble_check_error(err_code);
#if NRF_SD_BLE_API_VERSION>5
  if (!err_code) {
    jsble_check_error(sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, m_tx_power));
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    jsble_check_error(err_code);
  }
#elif NRF_SD_BLE_API_VERSION<5
  if (!err_code)
    err_code = sd_ble_gap_adv_start(&adv_params);
#else
  // do we care about SDK14?
  if (!err_code)
    err_code = sd_ble_gap_adv_start(&adv_params, APP_BLE_CONN_CFG_TAG);
#endif
  bleStatus |= BLE_IS_ADVERTISING;
  jsvUnLock(advDataVar);
  if (execInfo.root) // JS interpreter may not be initialised yet!
    bleQueueEventAndUnLock(JS_EVENT_PREFIX"advertising", jsvNewFromBool(true));
  return err_code;
}

uint32_t jsble_advertising_update_advdata(char *dPtr, unsigned int dLen) {
  return jsble_advertising_update((uint8_t *)dPtr, dLen, NULL, 0, NULL);
}
uint32_t jsble_advertising_update_scanresponse(char *dPtr, unsigned int dLen) {
  return jsble_advertising_update(NULL, 0, (uint8_t*)dPtr, dLen, NULL);
}

