espruino/Espruino/targets/nrf5x/bluetooth.c
void jsble_advertising_stop() {
  jsDebug(DBG_INFO,"jsble_advertising_stop\n");
  if (!(bleStatus & BLE_IS_ADVERTISING)) return;
#if NRF_SD_BLE_API_VERSION > 5
  sd_ble_gap_adv_stop(m_adv_handle);
#else
  sd_ble_gap_adv_stop();
#endif
  bleStatus &= ~BLE_IS_ADVERTISING;
  bleQueueEventAndUnLock(JS_EVENT_PREFIX"advertising", jsvNewFromBool(false));
}

/** Initialise the BLE stack */
 void jsble_init() {
  jsDebug(DBG_INFO,"jsble_init\n");
   uint32_t err_code;
   ble_stack_init();
   err_code = radio_notification_init(
 #ifdef NRF52_SERIES
                           6, /* IRQ Priority -  Must be 6 on nRF52. 7 doesn't work */
 #else
                           3, /* IRQ Priority -  nRF51 has different IRQ structure */
 #endif
                           NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE,
                           NRF_RADIO_NOTIFICATION_DISTANCE_NONE);
   APP_ERROR_CHECK(err_code);

#ifdef NRF52_SERIES
   // Set MAC address
   JsVar *v = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_MAC_ADDRESS);
   if (v) {
     ble_gap_addr_t p_addr;
     if (bleVarToAddr(v, &p_addr)) {
#if NRF_SD_BLE_API_VERSION < 3
       err_code = sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_NONE,&p_addr);
#else
       err_code = sd_ble_gap_addr_set(&p_addr);
#endif
       if (err_code) jsiConsolePrintf("sd_ble_gap_addr_set failed: 0x%x\n", err_code);
     }
   }
   jsvUnLock(v);
/*
   // This sets the MAC address to the default address, but "public", not "random"
   uint32_t addr0 =  NRF_FICR->DEVICEADDR[0];
   uint32_t addr1 =  NRF_FICR->DEVICEADDR[1];
   ble_gap_addr_t addr;
   addr.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC;
   addr.addr[5] = ((addr1>>8 )&0xFF)|0xC0;
   addr.addr[4] = ((addr1    )&0xFF);
   addr.addr[3] = ((addr0>>24)&0xFF);
   addr.addr[2] = ((addr0>>16)&0xFF);
   addr.addr[1] = ((addr0>> 8)&0xFF);
   addr.addr[0] = ((addr0    )&0xFF);
   err_code = sd_ble_gap_addr_set(&addr);
   if (err_code) jsiConsolePrintf("sd_ble_gap_addr_set failed: 0x%x\n", err_code);
 */
#endif

#if PEER_MANAGER_ENABLED
   peer_manager_init(false /*don't erase_bonds*/);
#endif
   gap_params_init();
   services_init();
   conn_params_init();

   // reset the status for things that aren't happening now we're rebooted
   bleStatus &= ~BLE_RESET_ON_SOFTDEVICE_START;
   // if we weren't sleeping, start advertising again
   if (!(bleStatus & BLE_IS_SLEEPING))
    jswrap_ble_wake();
}

/** Completely deinitialise the BLE stack */
bool jsble_kill() {
  jsDebug(DBG_INFO,"jsble_kill\n");
  jswrap_ble_sleep();
  // BLE NUS doesn't need deinitialising (no ble_nus_kill)
  bleStatus &= ~BLE_NUS_INITED;
  // BLE HID doesn't need deinitialising (no ble_hids_kill)
  bleStatus &= ~BLE_HID_INITED;
#if ESPR_BLUETOOTH_ANCS
  // BLE ANCS/AMS doesn't need deinitialising
  bleStatus &= ~BLE_ANCS_AMS_OR_CTS_INITED;
#endif
  uint32_t err_code;
#if NRF_SD_BLE_API_VERSION < 5
  err_code = sd_softdevice_disable();
#else
#ifndef NRF5X_SDK_15_3
  nrf_drv_clock_lfclk_request(NULL); // https://devzone.nordicsemi.com/f/nordic-q-a/56256/disabling-the-softdevice-hangs-when-using-lfrc-with-an-active-watchdog
#endif
  err_code = nrf_sdh_disable_request();
#endif
  return !jsble_check_error(err_code);
}


/** Stop and restart the softdevice so that we can update the services in it -
 * both user-defined as well as UART/HID */
void jsble_restart_softdevice(JsVar *jsFunction) {
  jsDebug(DBG_INFO,"jsble_restart_softdevice (%s)\n", (bleStatus&BLE_IS_SLEEPING)?"sleep":"awake");
  assert(!jsble_has_connection());
  bleStatus &= ~(BLE_NEEDS_SOFTDEVICE_RESTART | BLE_SERVICES_WERE_SET);
  bool bleWasSleeping = bleStatus & BLE_IS_SLEEPING;;
  // if we were scanning, make sure we stop
  if (bleStatus & BLE_IS_SCANNING) {
    sd_ble_gap_scan_stop();
  }
  //jsiConsolePrintf("Restart softdevice\n");
  jshUtilTimerDisable(); // don't want the util timer firing during this!
  JsSysTime lastTime = jshGetSystemTime();
  if (jsble_kill()) {
    if (jsvIsFunction(jsFunction))
      jspExecuteFunction(jsFunction,NULL,0,NULL);
    jsble_init();
    // reinitialise everything
    jswrap_ble_reconfigure_softdevice();
    jshSetSystemTime(lastTime); // Softdevice resets the RTC - so we must reset our offsets
  }
  jstRestartUtilTimer(); // restart the util timer
  if (!bleWasSleeping)
    jswrap_ble_wake();
  jsDebug(DBG_INFO,"jsble_restart_softdevice ends (%s)\n", (bleStatus&BLE_IS_SLEEPING)?"sleep":"awake");
}

uint32_t jsble_set_scanning(bool enabled, JsVar *options) {
  uint32_t err_code = 0;
  if (enabled) {
    if (bleStatus & BLE_IS_SCANNING) return 0;
    bleStatus |= BLE_IS_SCANNING;
    ble_gap_scan_params_t     m_scan_param;
    memset(&m_scan_param,0,sizeof(m_scan_param));
#if NRF_SD_BLE_API_VERSION>5
    m_scan_param.scan_phys         = BLE_GAP_PHY_AUTO;
    m_scan_param.filter_policy     = BLE_GAP_SCAN_FP_ACCEPT_ALL;
#endif
    m_scan_param.interval     = SCAN_INTERVAL;// Scan interval.
    m_scan_param.window       = SCAN_WINDOW;  // Scan window.
    m_scan_param.timeout      = 0x0000;       // No timeout - BLE_GAP_SCAN_TIMEOUT_UNLIMITED

    if (jsvIsObject(options)) {
      m_scan_param.active = jsvGetBoolAndUnLock(jsvObjectGetChildIfExists(options, "active")); // Active scanning set.
#if NRF_SD_BLE_API_VERSION>5
      if (jsvGetBoolAndUnLock(jsvObjectGetChildIfExists(options, "extended")))
        m_scan_param.extended = 1;
      JsVar *advPhy = jsvObjectGetChildIfExists(options, "phy");
      if (jsvIsUndefined(advPhy) || jsvIsStringEqual(advPhy,"1mbps")) {
        // default
      } else if (jsvIsStringEqual(advPhy,"2mbps")) {
        m_scan_param.scan_phys = BLE_GAP_PHY_2MBPS;
        m_scan_param.extended = 1;
      } else if (jsvIsStringEqual(advPhy,"both")) {
        m_scan_param.scan_phys = BLE_GAP_PHYS_SUPPORTED;
        m_scan_param.extended = 1;
      } else if (jsvIsStringEqual(advPhy,"coded")) {
        m_scan_param.scan_phys = BLE_GAP_PHY_CODED;
        m_scan_param.extended = 1;
      } else jsWarn("Unknown phy %q\n", advPhy);
      jsvUnLock(advPhy);
#endif
    }

    err_code = sd_ble_gap_scan_start(&m_scan_param
#if NRF_SD_BLE_API_VERSION>5
         , &m_scan_buffer
#endif
         );
  } else {
    if (!(bleStatus & BLE_IS_SCANNING)) return 0;
    bleStatus &= ~BLE_IS_SCANNING;
    err_code = sd_ble_gap_scan_stop();
  }
  return err_code;
}

