espruino/Espruino/targets/nrf5x/bluetooth.c
        memset(&attr_char_value, 0, sizeof(attr_char_value));
        attr_char_value.p_uuid       = &char_uuid;
        attr_char_value.p_attr_md    = &attr_md;
        attr_char_value.init_len     = 0;
        attr_char_value.init_offs    = 0;
        attr_char_value.p_value      = 0;
        attr_char_value.max_len      = (uint16_t)jsvGetIntegerAndUnLock(jsvObjectGetChildIfExists(charVar, "maxLen"));
        if (attr_char_value.max_len==0) attr_char_value.max_len=1;

        // get initial data
        JsVar *charValue = jsvObjectGetChildIfExists(charVar, "value");
        if (charValue) {
          JSV_GET_AS_CHAR_ARRAY(vPtr, vLen, charValue);
          if (vPtr && vLen) {
            attr_char_value.p_value = (uint8_t*)vPtr;
            attr_char_value.init_len = vLen;
            if (attr_char_value.init_len > attr_char_value.max_len)
              attr_char_value.max_len = attr_char_value.init_len;
          }
        }

        err_code = sd_ble_gatts_characteristic_add(service_handle,
                                                   &char_md,
                                                   &attr_char_value,
                                                   &characteristic_handles);
        jsble_check_error(err_code);
        jsvUnLock(charValue); // unlock here in case we were storing data in a flat string

        // Add onWrite callback
        JsVar *writeCb = jsvObjectGetChildIfExists(charVar, "onWrite");
        if (writeCb) {
          char eventName[12];
          bleGetWriteEventName(eventName, characteristic_handles.value_handle);
          jsvObjectSetChildAndUnLock(execInfo.root, eventName, writeCb);
        }
        // Add onWriteDesc callback for writes to the CCCD
        writeCb = jsvObjectGetChildIfExists(charVar, "onWriteDesc");
        if (writeCb) {
          char eventName[12];
          bleGetWriteEventName(eventName, characteristic_handles.cccd_handle);
          jsvObjectSetChildAndUnLock(execInfo.root, eventName, writeCb);
        }

        jsvUnLock(charVar);

        jsvObjectIteratorNext(&serviceit);
      }
      jsvObjectIteratorFree(&serviceit);
      jsvUnLock(serviceVar);

      jsvObjectIteratorNext(&it);
    }
    jsvObjectIteratorFree(&it);
  }
}

/// Disconnect from the given connection
uint32_t jsble_disconnect(uint16_t conn_handle) {
  return sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void jsble_startBonding(bool forceRePair) {
#if PEER_MANAGER_ENABLED
  if (!jsble_has_peripheral_connection())
      return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Not connected"));
  jsble_queue_pending(BLEP_BONDING_STATUS, BLE_BOND_REQUEST); // report that we've requested bonding
  uint32_t err_code = pm_conn_secure(m_peripheral_conn_handle, forceRePair);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_BONDING, errStr);
    jsvUnLock(errStr);
  }
#else
  return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Peer Manager not compiled in"));
#endif
}

#if BLE_HIDS_ENABLED
void jsble_send_hid_input_report(uint8_t *data, int length) {
  if (!(bleStatus & BLE_HID_INITED)) {
    jsExceptionHere(JSET_ERROR, "BLE HID not enabled");
    return;
  }
  if (!jsble_has_peripheral_connection()) {
    jsExceptionHere(JSET_ERROR, "Not connected!");
    return;
  }
  if (bleStatus & BLE_IS_SENDING_HID) {
    jsExceptionHere(JSET_ERROR, "BLE HID already sending");
    return;
  }
  if (length > HID_KEYS_MAX_LEN) {
    jsExceptionHere(JSET_ERROR, "BLE HID report too long - max length = %d\n", HID_KEYS_MAX_LEN);
    return;
  }

  uint32_t err_code;
  if (!m_in_boot_mode) {
      err_code = ble_hids_inp_rep_send(&m_hids,
                                       HID_INPUT_REPORT_KEYS_INDEX,
                                       length,
                                       data
#if NRF_SD_BLE_API_VERSION>5
                                       ,m_peripheral_conn_handle
#endif
                                       );
  } else {
      err_code = ble_hids_boot_kb_inp_rep_send(&m_hids,
                                               length,
                                               data
#if NRF_SD_BLE_API_VERSION>5
                                       ,m_peripheral_conn_handle
#endif
                                               );
  }
  if (!jsble_check_error(err_code))
    bleStatus |= BLE_IS_SENDING_HID;
}
#endif

#ifdef USE_NFC
void jsble_nfc_stop() {
  nfcEnabled = false;
  hal_nfc_stop();
  hal_nfc_done();
}

void jsble_nfc_get_internal(uint8_t *data, size_t *max_len) {

  uint32_t ret_val;

  ret_val = hal_nfc_parameter_get(HAL_NFC_PARAM_ID_INTERNAL, data, max_len);
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcGetInternal: Got NFC error code %d", ret_val);
}

void jsble_nfc_start(const uint8_t *data, size_t len) {
  jsble_nfc_stop();

  uint32_t ret_val;

  /* Set UID / UID Length */
  if (len)
    ret_val = hal_nfc_parameter_set(HAL_NFC_PARAM_ID_NFCID1, data, len);
  else
    ret_val = hal_nfc_parameter_set(HAL_NFC_PARAM_ID_NFCID1, "\x07", 1);
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcSetUid: Got NFC error code %d", ret_val);

  ret_val = hal_nfc_setup(nfc_callback, NULL);
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcSetup: Got NFC error code %d", ret_val);

  /* Start sensing NFC field */
  ret_val = hal_nfc_start();
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcStartEmulation: NFC error code %d", ret_val);

  nfcEnabled = true;
}

void jsble_nfc_send(const uint8_t *data, size_t len) {
  if (!nfcEnabled) return;

  uint32_t ret_val;

  ret_val = hal_nfc_send(data, len);
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcSend: NFC error code %d", ret_val);
}

void jsble_nfc_send_rsp(const uint8_t data, size_t len) {
  if (!nfcEnabled) return;

  uint32_t ret_val;

  ret_val = hal_nfc_send_rsp(data, len);
  if (ret_val)
    return jsExceptionHere(JSET_ERROR, "nfcSend: NFC error code %d", ret_val);
}
#endif

JsVar *jsble_get_security_status(uint16_t conn_handle) {
#if PEER_MANAGER_ENABLED
  JsVar *result = jsvNewWithFlags(JSV_OBJECT);
  if (!result) return 0;

  if (conn_handle == BLE_CONN_HANDLE_INVALID ||
      conn_handle == m_peripheral_conn_handle) {
    // is this NRF.getSecurityStatus?
    bool isAdvertising = bleStatus & BLE_IS_ADVERTISING;
    jsvObjectSetChildAndUnLock(result, "advertising", jsvNewFromBool(isAdvertising));
  }
  if (conn_handle == BLE_CONN_HANDLE_INVALID) {
    jsvObjectSetChildAndUnLock(result, "connected", jsvNewFromBool(false));
    return result;
  }
  pm_conn_sec_status_t status;
  uint32_t err_code = pm_conn_sec_status_get(conn_handle, &status);
  if (!jsble_check_error(err_code)) {
    jsvObjectSetChildAndUnLock(result, "connected", jsvNewFromBool(status.connected));
    jsvObjectSetChildAndUnLock(result, "encrypted", jsvNewFromBool(status.encrypted));
    jsvObjectSetChildAndUnLock(result, "mitm_protected", jsvNewFromBool(status.mitm_protected));
    jsvObjectSetChildAndUnLock(result, "bonded", jsvNewFromBool(status.bonded));
#ifndef SAVE_ON_FLASH
    if (status.connected && conn_handle==m_peripheral_conn_handle)
      jsvObjectSetChildAndUnLock(result, "connected_addr", bleAddrToStr(m_peripheral_addr));
#endif
    return result;
  }
  return 0;
#else
  jsExceptionHere(JSET_ERROR,"Peer Manager not compiled in");
  return 0;
#endif
}


/// Set the transmit power of the current (and future) connections
void jsble_set_tx_power(int8_t pwr) {
  uint32_t              err_code;
#if NRF_SD_BLE_API_VERSION > 5
  if (m_peripheral_conn_handle != BLE_CONN_HANDLE_INVALID)
    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_peripheral_conn_handle, pwr);
  for (int i=0;i<CENTRAL_LINK_COUNT;i++)
    if (m_central_conn_handles[i] != BLE_CONN_HANDLE_INVALID)
      err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_central_conn_handles[i], pwr);
  if (m_adv_handle != BLE_GAP_ADV_SET_HANDLE_NOT_SET)
    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, pwr);
  err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, 0/*ignored*/, pwr);
  if (!err_code)
    m_tx_power = pwr;
#else
  err_code = sd_ble_gap_tx_power_set(pwr);
#endif
  jsble_check_error(err_code);
}

#if CENTRAL_LINK_COUNT>0
void jsble_central_connect(ble_gap_addr_t peer_addr, JsVar *options) {
  uint32_t              err_code;

