espruino/Espruino/targets/nrf5x/bluetooth.c
  uint16_t handle = jsvGetIntegerAndUnLock(jsvObjectGetChildIfExists(characteristic, "handle_value"));
  uint32_t              err_code;
  err_code = sd_ble_gattc_read(central_conn_handle, handle, 0/*offset*/);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_CHARACTERISTIC_READ, errStr);
    jsvUnLock(errStr);
  }
}

void jsble_central_characteristicDescDiscover(uint16_t central_conn_handle, JsVar *characteristic) {
  if (central_conn_handle == BLE_CONN_HANDLE_INVALID)
    return bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_DESC_AND_STARTNOTIFY, jsvNewFromString("Not connected"));

  // start discovery for our single handle only
  uint16_t handle_value = (uint16_t)jsvGetIntegerAndUnLock(jsvObjectGetChildIfExists(characteristic, "handle_value"));

  ble_gattc_handle_range_t range;
  range.start_handle = handle_value+1;
  range.end_handle = handle_value+1;

  uint32_t              err_code;
  err_code = sd_ble_gattc_descriptors_discover(central_conn_handle, &range);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_CHARACTERISTIC_DESC_AND_STARTNOTIFY, errStr);
    jsvUnLock(errStr);
  }
}

void jsble_central_characteristicNotify(uint16_t central_conn_handle, JsVar *characteristic, bool enable) {
  if (central_conn_handle == BLE_CONN_HANDLE_INVALID)
    return bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_NOTIFY, jsvNewFromString("Not connected"));

  JsVar *cccdVar = jsvObjectGetChildIfExists(characteristic, "handle_cccd");
  if (!cccdVar)
    return bleCompleteTaskFailAndUnLock(BLETASK_CHARACTERISTIC_NOTIFY, jsvNewFromString("handle_cccd not set"));
  uint16_t cccd_handle = jsvGetIntegerAndUnLock(cccdVar);

  uint8_t buf[BLE_CCCD_VALUE_LEN];
  buf[0] = 0;
  buf[1] = 0;

  if (enable) {
    JsVar *properties = jsvObjectGetChildIfExists(characteristic,"properties");
    if (properties && jsvGetBoolAndUnLock(jsvObjectGetChildIfExists(properties,"notify"))) {
      // use notification if it exists
      buf[0] = BLE_GATT_HVX_NOTIFICATION;
    } else if (properties && jsvGetBoolAndUnLock(jsvObjectGetChildIfExists(properties,"indicate"))) {
      // otherwise default to indication
      buf[0] = BLE_GATT_HVX_INDICATION;
    } else {
      // no properties, or no notification or indication bit set
    }
    jsvUnLock(properties);
  }

  const ble_gattc_write_params_t write_params = {
      .write_op = BLE_GATT_OP_WRITE_REQ,
      .flags    = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
      .handle   = cccd_handle,
      .offset   = 0,
      .len      = sizeof(buf),
      .p_value  = buf
  };

  uint32_t              err_code;
  err_code = sd_ble_gattc_write(central_conn_handle, &write_params);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_CHARACTERISTIC_NOTIFY, errStr);
    jsvUnLock(errStr);
  }
}

void jsble_central_startBonding(uint16_t central_conn_handle, bool forceRePair) {
#if PEER_MANAGER_ENABLED
  if (central_conn_handle == BLE_CONN_HANDLE_INVALID)
      return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Not connected"));

  uint32_t err_code = pm_conn_secure(central_conn_handle, forceRePair);
  JsVar *errStr = jsble_get_error_string(err_code);
  if (errStr) {
    bleCompleteTaskFail(BLETASK_BONDING, errStr);
    jsvUnLock(errStr);
  }
#else
  return bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Peer Manager not compiled in"));
#endif
}

uint32_t jsble_central_send_passkey(uint16_t central_conn_handle, char *passkey) {
#ifdef LINK_SECURITY
  if (central_conn_handle == BLE_CONN_HANDLE_INVALID)
      return BLE_ERROR_INVALID_CONN_HANDLE;
  return sd_ble_gap_auth_key_reply(central_conn_handle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, (uint8_t*)passkey);
#endif
}

#endif // CENTRAL_LINK_COUNT>0

void jsble_central_setWhitelist(bool whitelist) {
#if PEER_MANAGER_ENABLED
  if (whitelist) {
    bleStatus |= BLE_WHITELIST_ON_BOND;
  } else {
    bleStatus &= ~BLE_WHITELIST_ON_BOND;
    m_whitelist_peer_cnt = 0;
    m_is_wl_changed = true;
    ble_update_whitelist();
  }
#endif
}

void jsble_central_eraseBonds() {
#if PEER_MANAGER_ENABLED
  jsble_check_error(pm_peers_delete());
#endif
}

#endif // BLUETOOTH


